<a href="https://colab.research.google.com/github/yardsale8/DSCI_210_R_notebooks/blob/main/lecture_7_2_1_basics_of_select_filter_mutate_and_pipes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
# This loads all of the dplyr functions
#must do everytime you start new R session
library("tidyverse")

── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.4     ✔ readr     2.1.5
✔ forcats   1.0.0     ✔ stringr   1.5.1
✔ ggplot2   3.4.4     ✔ tibble    3.2.1
✔ lubridate 1.9.3     ✔ tidyr     1.3.1
✔ purrr     1.0.2
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

# The basics of `select`, `filter`, `mutate`, and `pipes`.

In this notebook, we will look at the basics of data management in R, including

1. Applying `select`, `filter`, and `mutate`, and
2. Performing a data management process using a pipe.

## Example - Loading some survey data.

In [4]:
surveys <- read.csv('https://github.com/WSU-DataScience/DSCI_210_R_notebooks/raw/main/data/portal_data_joined.csv')
head(surveys)

  record_id month day year plot_id species_id sex hindfoot_length weight
1   1        7    16  1977 2       NL         M   32              NA
2  72        8    19  1977 2       NL         M   31              NA
3 224        9    13  1977 2       NL             NA              NA
4 266       10    16  1977 2       NL             NA              NA
5 349       11    12  1977 2       NL             NA              NA
6 363       11    12  1977 2       NL             NA              NA
  genus   species  taxa   plot_type
1 Neotoma albigula Rodent Control
2 Neotoma albigula Rodent Control
3 Neotoma albigula Rodent Control
4 Neotoma albigula Rodent Control
5 Neotoma albigula Rodent Control
6 Neotoma albigula Rodent Control

## Topic 1 - `select`, `filter`, and `mutate`

### Selecting columns with `select`

In [5]:
# Syntax: df %>% select(col1, col2, ...)
(surveys
 %>% select(plot_id, species_id, weight, year)
)

      plot_id species_id weight year
1     2       NL          NA    1977
2     2       NL          NA    1977
3     2       NL          NA    1977
4     2       NL          NA    1977
5     2       NL          NA    1977
6     2       NL          NA    1977
7     2       NL          NA    1977
8     2       NL          NA    1978
9     2       NL         218    1978
10    2       NL          NA    1978
11    2       NL          NA    1978
12    2       NL         204    1978
13    2       NL         200    1978
14    2       NL         199    1978
15    2       NL         197    1978
16    2       NL          NA    1978
17    2       NL         218    1978
18    2       NL         166    1979
19    2       NL         184    1979
20    2       NL         206    1979
21    2       NL         274    1979
22    2       NL         186    1979
23    2       NL         184    1980
24    2       NL          NA    1980
25    2       NL          87    1980
26    2       NL         174    1980
27    2       NL         130    1981
28    2       NL         208    1981
29    2       NL         192    1981
30    2       NL         206    1982
⋮     ⋮       ⋮          ⋮      ⋮
34757 7       CU         NA     1993
34758 7       PB         31     1997
34759 7       PB         24     1997
34760 7       PB         30     1997
34761 7       PB         32     1997
34762 7       PB         36     1997
34763 7       PB         37     1997
34764 7       PB         37     1997
34765 7       PB         40     1997
34766 7       PB         27     1998
34767 7       PB         23     1998
34768 7       PB         30     1998
34769 7       PB         23     1998
34770 7       PB         25     1998
34771 7       PB         25     1998
34772 7       PB         28     1999
34773 7       PB         20     2000
34774 7       PB         37     2001
34775 7       PB         32     2001
34776 7       PB         41     2001
34777 7       PB         44     2001
34778 7       PB         16     2002
34779 7       PB         30     2002
34780 7       PL         22     1997
34781 7       PL         16     1997
34782 7       PL         16     1997
34783 7       PL         22     1997
34784 7       PL          8     1998
34785 7       PX         NA     1998
34786 7       PX         NA     2000

**Note.** Looking at all that data is annoying $\rightarrow$ add a temporary `head` at the end of the pipe.

In [10]:
(surveys
 %>% select(plot_id, species_id, weight, year)
 %>% head. # Temp.  Remember to delete before saving
)

  plot_id species_id weight year
1 2       NL         NA     1977
2 2       NL         NA     1977
3 2       NL         NA     1977
4 2       NL         NA     1977
5 2       NL         NA     1977
6 2       NL         NA     1977

**Dropping columns with `-`**

In [12]:
# Syntax: df %>% select(-col1, -col2, ...)
(surveys
 %>% select(-record_id, -plot_type)
 %>% head # Temp.  Remember to delete before saving
)

  month day year plot_id species_id sex hindfoot_length weight genus   species
1  7    16  1977 2       NL         M   32              NA     Neotoma albigula
2  8    19  1977 2       NL         M   31              NA     Neotoma albigula
3  9    13  1977 2       NL             NA              NA     Neotoma albigula
4 10    16  1977 2       NL             NA              NA     Neotoma albigula
5 11    12  1977 2       NL             NA              NA     Neotoma albigula
6 11    12  1977 2       NL             NA              NA     Neotoma albigula
  taxa
1 Rodent
2 Rodent
3 Rodent
4 Rodent
5 Rodent
6 Rodent

### Filtering rows with `filter`

In [14]:
(surveys
 %>% filter(year == 1995)
 %>% head # Temp.  Remember to delete before saving
)

  record_id month day year plot_id species_id sex hindfoot_length weight
1 22314      6     7  1995 2       NL         M   34               NA
2 22728      9    23  1995 2       NL         F   32              165
3 22899     10    28  1995 2       NL         F   32              171
4 23032     12     2  1995 2       NL         F   33               NA
5 22003      1    11  1995 2       DM         M   37               41
6 22042      2     4  1995 2       DM         F   36               45
  genus     species  taxa   plot_type
1 Neotoma   albigula Rodent Control
2 Neotoma   albigula Rodent Control
3 Neotoma   albigula Rodent Control
4 Neotoma   albigula Rodent Control
5 Dipodomys merriami Rodent Control
6 Dipodomys merriami Rodent Control

**Combining with `&`   [AND]**

In [15]:
(surveys
 %>% filter(year == 1995 & sex == 'M')
 %>% head # Temp.  Remember to delete before saving
)

  record_id month day year plot_id species_id sex hindfoot_length weight
1 22314     6      7  1995 2       NL         M   34              NA
2 22003     1     11  1995 2       DM         M   37              41
3 22044     2      4  1995 2       DM         M   37              46
4 22109     3      4  1995 2       DM         M   37              46
5 22168     4      1  1995 2       DM         M   36              48
6 22368     6     27  1995 2       DM         M   37              44
  genus     species  taxa   plot_type
1 Neotoma   albigula Rodent Control
2 Dipodomys merriami Rodent Control
3 Dipodomys merriami Rodent Control
4 Dipodomys merriami Rodent Control
5 Dipodomys merriami Rodent Control
6 Dipodomys merriami Rodent Control

**Combining with `|`  [OR]**

In [16]:
(surveys
 %>% filter(sex == 'M' | sex == 'F')
 %>% head # Temp.  Remember to delete before saving
)

  record_id month day year plot_id species_id sex hindfoot_length weight
1    1      7     16  1977 2       NL         M   32               NA
2   72      8     19  1977 2       NL         M   31               NA
3  588      2     18  1978 2       NL         M   NA              218
4  845      5      6  1978 2       NL         M   32              204
5  990      6      9  1978 2       NL         M   NA              200
6 1164      8      5  1978 2       NL         M   34              199
  genus   species  taxa   plot_type
1 Neotoma albigula Rodent Control
2 Neotoma albigula Rodent Control
3 Neotoma albigula Rodent Control
4 Neotoma albigula Rodent Control
5 Neotoma albigula Rodent Control
6 Neotoma albigula Rodent Control

## <font color="red"> <b> Exercise 7.2.1 </b></font>

**Questions.**
1. Why are there columns not selected (last slide) still here?
2. How would we perform both the `select` and `filter` together?

<font color="orange">
Your answers here
</font>

## Topic 2 - Some good habits.

1. Perform all steps in one pipe,
2. Add a temporary `head` to the end of the pipe for cleaner output, and
3. Save and inspect the results of tables required for later tasks.

#### Perform all steps in one pipe.

In [ ]:
(surveys
 %>% select(plot_id, species_id, weight, year)
 %>% filter(year == 1995)
)

     plot_id species_id weight year
1    2       NL          NA    1995
2    2       NL         165    1995
3    2       NL         171    1995
4    2       NL          NA    1995
5    2       DM          41    1995
6    2       DM          45    1995
7    2       DM          46    1995
8    2       DM          49    1995
9    2       DM          46    1995
10   2       DM          48    1995
11   2       DM          48    1995
12   2       DM          44    1995
13   2       DM          27    1995
14   2       DM          37    1995
15   2       DM          26    1995
16   2       DM          41    1995
17   2       DM          43    1995
18   2       DM          50    1995
19   2       DM          44    1995
20   2       DM          31    1995
21   2       DM          44    1995
22   2       DM          31    1995
23   2       DM          50    1995
24   2       DM          40    1995
25   2       DM          43    1995
26   2       DM          47    1995
27   2       DM          43    1995
28   2       DM          51    1995
29   2       DM          23    1995
30   2       DM          42    1995
⋮    ⋮       ⋮          ⋮      ⋮
1151 16      RM         14     1995
1152 16      RM         12     1995
1153 16      AH         NA     1995
1154 16      AH         NA     1995
1155 16      DX         NA     1995
1156 23      RM         21     1995
1157 23      RM         17     1995
1158 23      PM         21     1995
1159 23      AH         NA     1995
1160 23      AB         NA     1995
1161 23      PU         NA     1995
1162  7      PE         20     1995
1163  7      PE         NA     1995
1164  7      PP         17     1995
1165  7      PP         18     1995
1166  7      PP         19     1995
1167  7      OT         23     1995
1168  7      RM          8     1995
1169  7      RM         10     1995
1170  7      RM         21     1995
1171  7      RM         20     1995
1172  7      RM         11     1995
1173  7      RM         10     1995
1174  7      RM         13     1995
1175  7      RM         12     1995
1176  7      RM          9     1995
1177  7      RM         11     1995
1178  7      RM         13     1995
1179  7      RM         12     1995
1180  7      AB         NA     1995

#### Output too long? $\rightarrow$ Temporarily shorten with `head`

Use `head` to inspect.

In [17]:
(surveys
 %>% select(plot_id, species_id, weight, year)
 %>% filter(year == 1995)
 %>% head  # Temporary - comment/remove before saving
)

  plot_id species_id weight year
1 2       NL          NA    1995
2 2       NL         165    1995
3 2       NL         171    1995
4 2       NL          NA    1995
5 2       DM          41    1995
6 2       DM          45    1995

#### Saving and inspecting the results of a computation

In [ ]:
(surveys
 %>% select(plot_id, species_id, weight, year)
 %>% filter(year == 1995)
#  %>% head  # Comment and move to last line
) -> survey_narrow

survey_narrow %>% head

  plot_id species_id weight year
1 2       NL          NA    1995
2 2       NL         165    1995
3 2       NL         171    1995
4 2       NL          NA    1995
5 2       DM          41    1995
6 2       DM          45    1995

## <font color="red"> Exercise 7.2.2 </font>

Write a single pipe to perform the following tasks.

1. Select the `weight`, `sex` and `gender` columns,
2. Filter out the rows that are `NA` (see [answer 1](https://stackoverflow.com/questions/28857653/removing-na-observations-with-dplyrfilter)), and
3. Save the resulting table to an appropriately named variable.
4. Write the table to a CSV and download the resulting file.

In [ ]:
# Your code here

## Topic 3 - Making a new column with `mutate`

**Syntax.**

```{R}
...
%>% mutate(new_col_name = _some_arithmetic_expression)
...
```

For example, suppose we want to convert the weight to kg.

In [ ]:
(surveys
 %>% select(plot_id, species_id, weight, year)
 %>% filter(year == 1995)
 %>% mutate(weight_kg = weight / 1000)        # Convert to kg.
 %>% select(-weight)                          # Drop the old weight column
) -> survey_narrow

survey_narrow %>% head

  plot_id species_id year weight_kg
1 2       NL         1995    NA
2 2       NL         1995 0.165
3 2       NL         1995 0.171
4 2       NL         1995    NA
5 2       DM         1995 0.041
6 2       DM         1995 0.045

## <font color="red"> Exercise 7.2.3 </font>

Write a single pipe to perform the following tasks.

1. Select the `weight`, `sex` and `gender` columns,
2. Filter out the rows that are `NA` (see [answer 1](https://stackoverflow.com/questions/28857653/removing-na-observations-with-dplyrfilter)), and
3. Compute the a weight of all species in lbs.
4. Save the resulting table to an appropriately named variable.
5. Write the table to a CSV and download the resulting file.

In [ ]:
# Your piped process here

## Motivating pipes

We prefer to use `%>%` to organize our data management steps in a pipe.  In this section, we will provide arguments why this is the preferred style.

### Imperative programming style

In [ ]:
new_df <- select(surveys, plot_id, species_id, weight, year)
new_df2 <- filter(new_df, year == 1995)
new_df3 <- mutate(new_df2, weight_kg = weight / 1000)
head(new_df3)

  plot_id species_id weight year weight_kg
1 2       NL          NA    1995    NA
2 2       NL         165    1995 0.165
3 2       NL         171    1995 0.171
4 2       NL          NA    1995    NA
5 2       DM          41    1995 0.041
6 2       DM          45    1995 0.045

### Imperative pattern - Save, save, save


<img width="450" src="https://github.com/WSU-DataScience/DSCI_210_R_notebooks/blob/main/img/imperative_pattern.png?raw=1">

- **Problem 1:** Lots of temporary variables
- **Problem 2:** Messy and lots of *overhead*
    - All the extra *stuff* clouds the meaning/intent of the code

### Poor solution - Rewrite to the same data frame

```{R}
surveys <- select(surveys, plot_id, species_id, weight, year)
surveys <- filter(surveys, year == 1995)
surveys <- mutate(surveys, weight_kg = weight / 1000)
```

<font color="red"> <b> Question.</b></font> What's the problems with this approach?<font size = 1>Answer below.</font>

<font color="orange" size=3>
You answer here
</font>

### Use a pipe for cleaner code

Pipe pushes the data frame through the first position:

<img width="350" src="https://github.com/WSU-DataScience/DSCI_210_R_notebooks/blob/main/img/pipe1.png?raw=1">

### Imagine an invisible data frame in the first spot...

Important Point - Each data frame is NEW

<img width="350" src="https://github.com/WSU-DataScience/DSCI_210_R_notebooks/blob/main/img/pipe2.png?raw=1">

### ... but don't write it!

In [ ]:
surveys  %>%
  select(plot_id, species_id, weight, year) %>%
  filter(year == 1995) %>%
  mutate(weight_kg = weight / 1000) %>%
  head()

  plot_id species_id weight year weight_kg
1 2       NL          NA    1995    NA
2 2       NL         165    1995 0.165
3 2       NL         171    1995 0.171
4 2       NL          NA    1995    NA
5 2       DM          41    1995 0.041
6 2       DM          45    1995 0.045

### My preferred code format

In [ ]:
(surveys
 %>% select(plot_id, species_id, weight, year)
 %>% filter(year == 1995)
 %>% mutate(weight_kg = weight / 1000)
 %>% head()
 ) -> survey_clean

 survey_clean

  plot_id species_id weight year weight_kg
1 2       NL          NA    1995    NA
2 2       NL         165    1995 0.165
3 2       NL         171    1995 0.171
4 2       NL          NA    1995    NA
5 2       DM          41    1995 0.041
6 2       DM          45    1995 0.045

## Deliverables

Please submit the following on D2L.

1. A WORD document containing screenshots of your solutions (code + output), and
2. A share link to your notebook.  You will need to save a copy of your notebook and change the share permissions to allow anyone with the link access.